docs/notes/emacs/dap.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Dap Mode</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/static/main.css" />
</head>
<body>
<div id="preamble" class="status">
<nav id="navbar" class="cf">
  <ul class="cf">
    <li class="fl">
      <a href="/">cfclrk</a>
    </li>
    <li class="fr">
      <a href="/articles/home.html">Articles</a>
    </li>
    <li class="fr">
      <a href="/notes/home.html">Notes</a>
    </li>
	<li class="fr">
      <a href="/cloudformation/home.html">CloudFormation</a>
    </li>
  </ul>
</nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Dap Mode</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orge477486">How To Python</a>
<ul>
<li><a href="#orgb194d35">Jumping in the Stack</a></li>
<li><a href="#org0762cb6">Rerun Last</a></li>
</ul>
</li>
<li><a href="#org4cbca7e">Old Sessions</a></li>
</ul>
</div>
</nav>

<div id="outline-container-orge477486" class="outline-2">
<h2 id="orge477486"><a href="#orge477486">How To Python</a></h2>
<div class="outline-text-2" id="text-orge477486">
<ul class="org-ul">
<li>Ensure <a href="https://github.com/microsoft/debugpy">debugpy</a> is installed (<code>pip install debugpy</code>) in the virtual
environment. I install this by default in new virtual environments (see:
<a href="https://github.com/cfclrk/dotfiles/blob/master/.pyenv/default_packages">.pyenv/default<sub>packages</sub></a>).</li>
</ul>

<p>
In source file, move point somewhere you want a breakpoint, and run
<code>M-x dap-breakpoint-toggle</code>
</p>

<p>
Go to test file, move point to a test. Run <code>dap-debug</code>. Select option to run
the pytest test at point.
</p>
</div>

<div id="outline-container-orgb194d35" class="outline-3">
<h3 id="orgb194d35"><a href="#orgb194d35">Jumping in the Stack</a></h3>
<div class="outline-text-3" id="text-orgb194d35">
<p>
You can jump forward or backward in the stack. Use <code>M-x
   dap-switch-stack-frame</code>, or click around in the "Debug Sessions" dap buffer.
</p>

<p>
TODO: How does this work? Does this only work in languages with first-class
continuations? How much program state is actually restored?
</p>

<ul class="org-ul">
<li><code>dap-disconnect</code> Quit the debugging session</li>
</ul>
</div>
</div>

<div id="outline-container-org0762cb6" class="outline-3">
<h3 id="org0762cb6"><a href="#org0762cb6">Rerun Last</a></h3>
<div class="outline-text-3" id="text-org0762cb6">
<p>
<code>dap</code>
</p>
</div>
</div>
</div>

<div id="outline-container-org4cbca7e" class="outline-2">
<h2 id="org4cbca7e"><a href="#org4cbca7e">Old Sessions</a></h2>
<div class="outline-text-2" id="text-org4cbca7e">
<p>
Saves output from old debug sessions
</p>

<p>
Delete them in the <code>dap-ui-sessions</code> buffer, <code>D</code>
</p>
</div>
</div>
</div>
</body>
</html>
